## PART 01) 데이터 다루기

## 4장. 데이터 결합 및 요약

### 1절. 데이터 결합

#### 1. 데이터 붙이기

In [1]:
import pandas as pd

# 데이터프레임1 생성
obj1 = {'student_id' : ['s1', 's2', 's3', 's4', 's5', 's6'],
        'score' : [55, 90, 85, 71, 63, 99]}
df1 = pd.DataFrame(obj1)
print(df1)

# 데이터프레임2 생성
obj2 = {'student_id' : ['t1', 't2', 't3', 't4', 't5', 't6'],
        'score' : [65, 99, 87, 75, 57, 88]}
df2 = pd.DataFrame(obj2)
print(df2)

  student_id  score
0         s1     55
1         s2     90
2         s3     85
3         s4     71
4         s5     63
5         s6     99
  student_id  score
0         t1     65
1         t2     99
2         t3     87
3         t4     75
4         t5     57
5         t6     88

In [2]:
# pandas.concat()
# 두 데이터프레임을 행을 기준으로 붙임
pd.concat([df1, df2])

  student_id  score
0         s1     55
1         s2     90
2         s3     85
3         s4     71
4         s5     63
5         s6     99
0         t1     65
1         t2     99
2         t3     87
3         t4     75
4         t5     57
5         t6     88

In [3]:
# 두 데이터프레임을 열을 기준으로 붙임
pd.concat([df1, df2], axis = 1)

  student_id  score student_id  score
0         s1     55         t1     65
1         s2     90         t2     99
2         s3     85         t3     87
3         s4     71         t4     75
4         s5     63         t5     57
5         s6     99         t6     88

#### 2. 데이터 병합

In [4]:
import pandas as pd

# 데이터프레임1 생성
obj1 = {'student_id' : ['s3', 's4', 's5', 's6'],
        'stat_score' : [85, 71, 63, 99]}
df1 = pd.DataFrame(obj1)
print(df1)

# 데이터프레임2 생성
obj2 = {'student_id' : ['s1', 's2', 's3', 's4'],
        'math_score' : [65, 99, 87, 75]}
df2 = pd.DataFrame(obj2)
print(df2)

  student_id  stat_score
0         s3          85
1         s4          71
2         s5          63
3         s6          99
  student_id  math_score
0         s1          65
1         s2          99
2         s3          87
3         s4          75

In [5]:
# 데이터프레임객체.merge()
# 두 데이터프레임 병합

# Case1. 병합유형(how) : inner(default)
# 두 데이터프레임의 공통 학생들의 점수만이 합쳐짐
df1.merge(df2, on = 'student_id')

  student_id  stat_score  math_score
0         s3          85          87
1         s4          71          75

In [6]:
# Case2. 병합유형(how) : outer
# 두 데이터프레임의 모든 학생들의 점수가 합쳐짐
# 점수가 없는 과목은 NaN을 반환
# 학생 순서는 왼쪽 데이터 프레임인(df1)에 있는 student_id 먼저 나옴
df1.merge(df2, how = 'outer', on = 'student_id')

  student_id  stat_score  math_score
0         s3        85.0        87.0
1         s4        71.0        75.0
2         s5        63.0         NaN
3         s6        99.0         NaN
4         s1         NaN        65.0
5         s2         NaN        99.0

In [7]:
# Case3. 병합유형(how) : left
# 왼쪽 데이터 프레임(df1)에 있는 학생들의 점수들만 반환
# 점수가 없는 과목은 NaN을 반환
df1.merge(df2, how = 'left', on = 'student_id')

  student_id  stat_score  math_score
0         s3          85        87.0
1         s4          71        75.0
2         s5          63         NaN
3         s6          99         NaN

In [8]:
# Case4. 병합유형(how) : right
# 오른쪽 데이터 프레임(df2)에 있는 학생들의 점수들만 반환
# 점수가 없는 과목은 NaN을 반환
df1.merge(df2, how = 'right', on = 'student_id')

  student_id  stat_score  math_score
0         s1         NaN          65
1         s2         NaN          99
2         s3        85.0          87
3         s4        71.0          75

### 2절. 데이터 요약

#### 1. 그룹별 통계 요약

In [9]:
# .groupby()

# 데이터프레임 생성
import pandas as pd
obj = {'student_id' : ['s1', 's2', 's3', 's4', 's5', 's6'],
        'stat_score' : [55, 90, 85, 71, 63, 99],
        'math_score' : [65, 99, 87, 75, 57, 88],
        'sex' : ['Female', 'Male', 'Female', 'Female', 'Male', 'Male'],
        'pre_level' : ['B', 'A', 'B', 'B', 'C', 'A']
       }
df = pd.DataFrame(obj)
print(df)

  student_id  stat_score  math_score     sex pre_level
0         s1          55          65  Female         B
1         s2          90          99    Male         A
2         s3          85          87  Female         B
3         s4          71          75  Female         B
4         s5          63          57    Male         C
5         s6          99          88    Male         A

In [10]:
# 그룹화한 후 데이터프레임 메소드 mean()을 통해 그룹화 평균 계산 가능
df.groupby('sex').mean()

        stat_score  math_score
sex
Female   70.333333   75.666667
Male     84.000000   81.333333

In [13]:
# 옵션 as_index = False
# 행인덱스로 행위치 인덱스 번호를 사용함
df.groupby('sex', as_index = False).mean()

      sex  stat_score  math_score
0  Female   70.333333   75.666667
1    Male   84.000000   81.333333

In [11]:
# 여러 열을 기준으로 그룹화하는 방법은 컬럼명을 담은 리스트를 사용
df.groupby(['sex', 'pre_level'], as_index = False).mean()

      sex pre_level  stat_score  math_score
0  Female         B   70.333333   75.666667
1    Male         A   94.500000   93.500000
2    Male         C   63.000000   57.000000

In [12]:
# describe() 메소드는 여러 종류의 특정한 통계량들을 제공
df.groupby('sex', as_index = False).describe()

  stat_score                                                     math_score  \
       count       mean        std   min   25%   50%   75%   max      count
0        3.0  70.333333  15.011107  55.0  63.0  71.0  78.0  85.0        3.0
1        3.0  84.000000  18.734994  63.0  76.5  90.0  94.5  99.0        3.0


        mean        std   min   25%   50%   75%   max
0  75.666667  11.015141  65.0  70.0  75.0  81.0  87.0
1  81.333333  21.779195  57.0  72.5  88.0  93.5  99.0

In [13]:
# .agg
# 동시에 원하는 여러 통계량
import numpy as np
df.groupby('sex').agg([np.mean, sum])

<ipython-input-13-0e238a6a0aa6>:4: FutureWarning: ['student_id', 'pre_level'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby('sex').agg([np.mean, sum])

       stat_score      math_score
             mean  sum       mean  sum
sex
Female  70.333333  211  75.666667  227
Male    84.000000  252  81.333333  244

In [14]:
# 컬럼별로 상이한 통계량
df.groupby('sex', as_index = False).agg({'stat_score' : np.mean,'math_score' : sum})

      sex  stat_score  math_score
0  Female   70.333333         227
1    Male   84.000000         244

In [15]:
df.groupby('sex', as_index = False).agg({'stat_score' : [np.mean, np.median],
                                         'math_score' : [sum, max]})

      sex stat_score        math_score
                mean median        sum max
0  Female  70.333333   71.0        227  87
1    Male  84.000000   90.0        244  99

#### 2. 데이터에 함수 적용하기

##### 가. 시리즈에 함수 적용하기

In [16]:
import pandas as pd

# 데이터프레임 생성
obj = {'student_id' : ['s1', 's2', 's3', 's4', 's5', 's6'],
        'stat_score' : [55, 90, 85, 71, 63, 99],
        'math_score' : [65, 99, 87, 75, 57, 88],
        'sex' : ['Female', 'Male', 'Female', 'Female', 'Male', 'Male'],
        'pre_level' : ['B', 'A', 'B', 'B', 'C', 'A']
       }
df = pd.DataFrame(obj)
print(df)

  student_id  stat_score  math_score     sex pre_level
0         s1          55          65  Female         B
1         s2          90          99    Male         A
2         s3          85          87  Female         B
3         s4          71          75  Female         B
4         s5          63          57    Male         C
5         s6          99          88    Male         A

In [17]:
# pre_level 컬럼 라벨인코딩
df['pre_level'].map({'A' : 0, 'B' : 1, 'C' : 2})

0    1
1    0
2    1
3    1
4    2
5    0
Name: pre_level, dtype: int64

In [18]:
# sex 컬럼의 요소를 한글로 변경
df['sex'].map({'Female' : '여자', 'Male' : '남자'})

0    여자
1    남자
2    여자
3    여자
4    남자
5    남자
Name: sex, dtype: object

In [19]:
# 시리즈에 사용자 정의 함수 적용
def f(x) :
    return x ** 2 + 2*x - 5000  # 각 요소에 적용할 함수

df['stat_score'].map(f)

0   -1865
1    3280
2    2395
3     183
4    -905
5    4999
Name: stat_score, dtype: int64

##### 나. 데이터프레임에 함수 적용하기

In [20]:
# .apply
df[['stat_score', 'math_score']].apply(np.sum)

stat_score    463
math_score    471
dtype: int64

In [21]:
df[['stat_score', 'math_score']].apply(np.sum, axis = 1)

0    120
1    189
2    172
3    146
4    120
5    187
dtype: int64

In [22]:
# apply 메소드 없이도 가능
df[['stat_score', 'math_score']].sum()

stat_score    463
math_score    471
dtype: int64

In [23]:
df[['stat_score', 'math_score']].sum(axis = 1)

0    120
1    189
2    172
3    146
4    120
5    187
dtype: int64

-----

## 5장. 결측치와 이상치

### 1절. 결측치

#### 1. 결측치 인식

In [24]:
# 결측치가 포함되도록 데이터프레임 생성
obj = {'student_id' : ['s1', 's2', 's3', 's4', 's5', 's6'],
        'stat_score' : [None, 90, 85, 71, 63, None],
        'math_score' : [65, None, 87, 75, 57, 88],
        'sex' : ['Female', 'Male', 'Female', None, 'Male', 'Male'],
        'pre_level' : ['B', 'A', 'B', 'B', 'C', None]
       }
df = pd.DataFrame(obj)
df

  student_id  stat_score  math_score     sex pre_level
0         s1         NaN        65.0  Female         B
1         s2        90.0         NaN    Male         A
2         s3        85.0        87.0  Female         B
3         s4        71.0        75.0    None         B
4         s5        63.0        57.0    Male         C
5         s6         NaN        88.0    Male      None

In [25]:
# .isnull() : 결측치 여부 확인
df.isnull()

   student_id  stat_score  math_score    sex  pre_level
0       False        True       False  False      False
1       False       False        True  False      False
2       False       False       False  False      False
3       False       False       False   True      False
4       False       False       False  False      False
5       False        True       False  False       True

In [26]:
# .isna() : 결측치 여부 확인
df.isna()

   student_id  stat_score  math_score    sex  pre_level
0       False        True       False  False      False
1       False       False        True  False      False
2       False       False       False  False      False
3       False       False       False   True      False
4       False       False       False  False      False
5       False        True       False  False       True

In [27]:
# 컬럼별 결측치 개수
df.isnull().sum()

student_id    0
stat_score    2
math_score    1
sex           1
pre_level     1
dtype: int64

In [28]:
# 행별 결측치 개수
df.isnull().sum(axis = 1)

0    1
1    1
2    0
3    1
4    0
5    2
dtype: int64

#### 2. 결측치 처리

##### 가. 결측치 제거

In [29]:
# .dropna()
# 결측치가 있는 행을 모두 제거
df.dropna()

  student_id  stat_score  math_score     sex pre_level
2         s3        85.0        87.0  Female         B
4         s5        63.0        57.0    Male         C

In [30]:
# 열도 가능
df.dropna(axis = 1)

  student_id
0         s1
1         s2
2         s3
3         s4
4         s5
5         s6

In [31]:
# 'stat_score' 컬럼(시리즈)에서 결측인 요소 제거
df['stat_score'].dropna()

1    90.0
2    85.0
3    71.0
4    63.0
Name: stat_score, dtype: float64

In [32]:
# 'stat_score'과 'math_score'컬럼 중
# 결측치가 있는 모든 행을 제거
df[['stat_score', 'math_score']].dropna()

   stat_score  math_score
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0

##### 나. 평균 대치법

In [33]:
# 숫자형 컬럼만 추출
df1 = df[['stat_score','math_score']].copy() # copy() 원본 소실 방지
df1

   stat_score  math_score
0         NaN        65.0
1        90.0         NaN
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0
5         NaN        88.0

In [34]:
# .fillna
# 결측치를 모두 0으로 대치
df1.fillna(0)

   stat_score  math_score
0         0.0        65.0
1        90.0         0.0
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0
5         0.0        88.0

In [35]:
# 평균 대치
# 컬럼별 평균으로 대치
df1.fillna(df1.mean())

   stat_score  math_score
0       77.25        65.0
1       90.00        74.4
2       85.00        87.0
3       71.00        75.0
4       63.00        57.0
5       77.25        88.0

### 2절. 이상치

#### 1. 이상치란

코드 없음

#### 2. 이상치 인식과 제거

##### 가. 사분위수를 이용한 이상치 판별

코드 없음

##### 나. 이상치 제거

In [36]:
# 데이터프레임 생성
obj = {'student_id' : ['s1', 's2', 's3', 's4', 's5', 's6'],
        'stat_score' : [55, 90, 85, 10, 88, 99],
        'math_score' : [65, 99, 67, 70, 57, 80],
       }
df = pd.DataFrame(obj)
print(df)

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
3         s4          10          70
4         s5          88          57
5         s6          99          80

In [37]:
# 'stat_score' 컬럼에 대하여 이상치를 판별하고 제거
q1 = df['stat_score'].quantile(0.25) # 제1사분위수
q3 = df['stat_score'].quantile(0.75) # 제3사분위수

iqr = q3 - q1 # IQR

In [38]:
lower = q1 - 1.5 * iqr # lower whisker
upper = q3 + 1.5 * iqr # upper whisker

In [39]:
# 이상치 판별
# upper whisker보다 크거나 lower whisker보다 작은 값들
df[(df['stat_score'] < lower) | (df['stat_score'] > upper)]

  student_id  stat_score  math_score
3         s4          10          70

In [40]:
# 이상치 제거
df[(df['stat_score'] > lower) & (df['stat_score'] < upper)]

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
4         s5          88          57
5         s6          99          80

---

## 6장. 기타 데이터 전처리

### 1절. 텍스트 데이터 다루기

#### 1. 문자열 데이터 전처리

In [41]:
import pandas as pd

# 데이터프레임 불러오기
# 인코딩 옵션(encoding = 'CP949')을 사용해 한글이 깨지는 것 방지
df = pd.read_csv('data/예제/University_text_after.csv', encoding = 'CP949')
df

       대학이름                      주소
0     서울대학교         서울특별시 관악구 관악로 1
1     KAIST       대전광역시 유성구 대학로 291
2    성균관대학교     서울특별시 종로구 성균관로 25-2
3     연세대학교       서울특별시 서대문구 연세로 50
4     UNIST  울산광역시 울주군 언양읍 유니스트길 50
5   포항공과대학교      경상북도 포항시 남구 청암로 77
6     고려대학교       서울특별시 성북구 안암로 145
7     경희대학교      서울특별시 동대문구 경희대로 26
8     세종대학교       서울특별시 광진구 능동로 209
9     한양대학교      서울특별시 성동구 왕십리로 222
10     GIST      광주광역시 북구 첨단과기로 123
11    아주대학교    경기도 수원시 영통구 월드컵로 206
12    중앙대학교        서울특별시 동작구 흑석로 84
13  이화여자대학교     서울특별시 서대문구 이화여대길 52
14    건국대학교       서울특별시 광진구 능동로 120
15    경북대학교         대구광역시 북구 대학로 80
16    울산대학교         울산광역시 남구 대학로 93
17    부산대학교   부산광역시 금정구 부산대학로63번길 2
18    영남대학교        경상북도 경산시 대학로 280
19   가톨릭대학교   서울특별시 종로구 창경궁로 296-12

In [42]:
# 시리즈객체.str[]
# 단순하게 인덱싱과 슬라이싱 가능
df['주소'].str[0:5] # 처음부터 5개의 문자열을 추출

0     서울특별시
1     대전광역시
2     서울특별시
3     서울특별시
4     울산광역시
5     경상북도
6     서울특별시
7     서울특별시
8     서울특별시
9     서울특별시
10    광주광역시
11    경기도 수
12    서울특별시
13    서울특별시
14    서울특별시
15    대구광역시
16    울산광역시
17    부산광역시
18    경상북도
19    서울특별시
Name: 주소, dtype: object

In [43]:
# str.startswith(pat)
# pat(문자열)로 시작한다면 True, 아니면 Fasle 반환
df['주소'].str.startswith("서울") # '서울'로 시작하면 True, 아니면 False

0      True
1     False
2      True
3      True
4     False
5     False
6      True
7      True
8      True
9      True
10    False
11    False
12     True
13     True
14     True
15    False
16    False
17    False
18    False
19     True
Name: 주소, dtype: bool

In [44]:
# 주소가 '서울'로 시작하는 데이터셋 추출
df[df['주소'].str.startswith("서울")]

       대학이름                     주소
0     서울대학교        서울특별시 관악구 관악로 1
2    성균관대학교    서울특별시 종로구 성균관로 25-2
3     연세대학교      서울특별시 서대문구 연세로 50
6     고려대학교      서울특별시 성북구 안암로 145
7     경희대학교     서울특별시 동대문구 경희대로 26
8     세종대학교      서울특별시 광진구 능동로 209
9     한양대학교     서울특별시 성동구 왕십리로 222
12    중앙대학교       서울특별시 동작구 흑석로 84
13  이화여자대학교    서울특별시 서대문구 이화여대길 52
14    건국대학교      서울특별시 광진구 능동로 120
19   가톨릭대학교  서울특별시 종로구 창경궁로 296-12

In [45]:
# 주소가 '서울'로 시작하지 않는 데이터셋 추출
df[~df['주소'].str.startswith("서울")] # ~는 부정

       대학이름                      주소
1     KAIST       대전광역시 유성구 대학로 291
4     UNIST  울산광역시 울주군 언양읍 유니스트길 50
5   포항공과대학교      경상북도 포항시 남구 청암로 77
10     GIST      광주광역시 북구 첨단과기로 123
11    아주대학교    경기도 수원시 영통구 월드컵로 206
15    경북대학교         대구광역시 북구 대학로 80
16    울산대학교         울산광역시 남구 대학로 93
17    부산대학교   부산광역시 금정구 부산대학로63번길 2
18    영남대학교        경상북도 경산시 대학로 280

In [46]:
# str.endswith(pat)
# pat(문자열)로 끝난다면 True, 아니면 Fasle 반환
df['대학이름'].str.endswith("대학교") # '대학교'로 끝나면 True, 아니면 False

0      True
1     False
2      True
3      True
4     False
5      True
6      True
7      True
8      True
9      True
10    False
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
Name: 대학이름, dtype: bool

In [47]:
# 대학이름이 '대학교'로 끝나는 데이터셋 추출
df[df['대학이름'].str.endswith("대학교")]

       대학이름                     주소
0     서울대학교        서울특별시 관악구 관악로 1
2    성균관대학교    서울특별시 종로구 성균관로 25-2
3     연세대학교      서울특별시 서대문구 연세로 50
5   포항공과대학교     경상북도 포항시 남구 청암로 77
6     고려대학교      서울특별시 성북구 안암로 145
7     경희대학교     서울특별시 동대문구 경희대로 26
8     세종대학교      서울특별시 광진구 능동로 209
9     한양대학교     서울특별시 성동구 왕십리로 222
11    아주대학교   경기도 수원시 영통구 월드컵로 206
12    중앙대학교       서울특별시 동작구 흑석로 84
13  이화여자대학교    서울특별시 서대문구 이화여대길 52
14    건국대학교      서울특별시 광진구 능동로 120
15    경북대학교        대구광역시 북구 대학로 80
16    울산대학교        울산광역시 남구 대학로 93
17    부산대학교  부산광역시 금정구 부산대학로63번길 2
18    영남대학교       경상북도 경산시 대학로 280
19   가톨릭대학교  서울특별시 종로구 창경궁로 296-12

In [48]:
# 대학이름이 '대학교'로 끝나지 않는 데이터셋 추출
df[~df['대학이름'].str.endswith("대학교")]

     대학이름                      주소
1   KAIST       대전광역시 유성구 대학로 291
4   UNIST  울산광역시 울주군 언양읍 유니스트길 50
10   GIST      광주광역시 북구 첨단과기로 123

In [49]:
# str.contains(pat)
# pat(문자열 또는 정규식)이 포함되면 True, 아니면 Fasle 반환
df['주소'].str.contains('광역시')

0     False
1      True
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14    False
15     True
16     True
17     True
18    False
19    False
Name: 주소, dtype: bool

In [50]:
# 주소에 '광역시'를 포함하는 데이터셋 추출
df[df['주소'].str.contains('광역시')]

     대학이름                      주소
1   KAIST       대전광역시 유성구 대학로 291
4   UNIST  울산광역시 울주군 언양읍 유니스트길 50
10   GIST      광주광역시 북구 첨단과기로 123
15  경북대학교         대구광역시 북구 대학로 80
16  울산대학교         울산광역시 남구 대학로 93
17  부산대학교   부산광역시 금정구 부산대학로63번길 2

In [51]:
# str.split(pat=None)
# pat를 기준으로 문자열을 분할
df['주소'].str.split() # 공백을 기준으로 분리

0             [서울특별시, 관악구, 관악로, 1]
1           [대전광역시, 유성구, 대학로, 291]
2         [서울특별시, 종로구, 성균관로, 25-2]
3           [서울특별시, 서대문구, 연세로, 50]
4     [울산광역시, 울주군, 언양읍, 유니스트길, 50]
5         [경상북도, 포항시, 남구, 청암로, 77]
6           [서울특별시, 성북구, 안암로, 145]
7          [서울특별시, 동대문구, 경희대로, 26]
8           [서울특별시, 광진구, 능동로, 209]
9          [서울특별시, 성동구, 왕십리로, 222]
10         [광주광역시, 북구, 첨단과기로, 123]
11      [경기도, 수원시, 영통구, 월드컵로, 206]
12           [서울특별시, 동작구, 흑석로, 84]
13        [서울특별시, 서대문구, 이화여대길, 52]
14          [서울특별시, 광진구, 능동로, 120]
15            [대구광역시, 북구, 대학로, 80]
16            [울산광역시, 남구, 대학로, 93]
17      [부산광역시, 금정구, 부산대학로63번길, 2]
18           [경상북도, 경산시, 대학로, 280]
19      [서울특별시, 종로구, 창경궁로, 296-12]
Name: 주소, dtype: object

In [52]:
# str.find(sub, start=0, end=None)
# sub가 있는 위치를 start에서부터 end까지에서 찾아 위치값을 반환
df['주소'].str.find('구') # '구'가 있는 위치 인덱스

0      8
1      8
2      8
3      9
4     -1
5     10
6      8
7      9
8      8
9      8
10     7
11    10
12     8
13     9
14     8
15     1
16     7
17     8
18    -1
19     8
Name: 주소, dtype: int64

In [53]:
# str.rfind(sub, start=0, end=None)
# sub가 있는 위치를 start에서부터 end까지에서 찾아 가장 높은 위치값을 반환
df['주소'].str.rfind(sub = ' ') # 가장 뒤에 있는 공백 위치

0     13
1     13
2     14
3     14
4     19
5     15
6     13
7     15
8     13
9     14
10    14
11    16
12    13
13    16
14    13
15    12
16    12
17    19
18    12
19    14
Name: 주소, dtype: int64

In [54]:
# str.findall(pat)
# 모든 pat(문자열 또는 정규식) 항목을 반환
df['주소'].str.findall('\w+구') # 구로 끝나는 단어들을 모두 반환

0        [관악구]
1        [유성구]
2        [종로구]
3       [서대문구]
4           []
5         [남구]
6        [성북구]
7       [동대문구]
8        [광진구]
9        [성동구]
10        [북구]
11       [영통구]
12       [동작구]
13      [서대문구]
14       [광진구]
15    [대구, 북구]
16        [남구]
17       [금정구]
18          []
19       [종로구]
Name: 주소, dtype: object

In [55]:
# str.replace(pat, repl)
# pat를 repl으로 대치함
df['주소'].str.replace(" ", "_") # 공백을 '_'로 대치함

0            서울특별시_관악구_관악로_1
1          대전광역시_유성구_대학로_291
2        서울특별시_종로구_성균관로_25-2
3          서울특별시_서대문구_연세로_50
4     울산광역시_울주군_언양읍_유니스트길_50
5         경상북도_포항시_남구_청암로_77
6          서울특별시_성북구_안암로_145
7         서울특별시_동대문구_경희대로_26
8          서울특별시_광진구_능동로_209
9         서울특별시_성동구_왕십리로_222
10        광주광역시_북구_첨단과기로_123
11      경기도_수원시_영통구_월드컵로_206
12          서울특별시_동작구_흑석로_84
13       서울특별시_서대문구_이화여대길_52
14         서울특별시_광진구_능동로_120
15           대구광역시_북구_대학로_80
16           울산광역시_남구_대학로_93
17     부산광역시_금정구_부산대학로63번길_2
18          경상북도_경산시_대학로_280
19     서울특별시_종로구_창경궁로_296-12
Name: 주소, dtype: object

In [56]:
# 데이터프레임 불러오기
df = pd.read_csv('data/예제/University_text_before.csv', encoding = 'CP949')
df

       대학이름                                  주소
0     서울대학교                   /!서울특별시 관악구 관악로 1
1     KAIST                대전광역시 유성구 대학로 291 ##
2    성균관대학교                 서울특별시 종로구 성균관로 25-2
3     연세대학교                   서울특별시 서대문구 연세로 50
4     UNIST         ## 울산광역시 울주군 언양읍 유니스트길 50 %
5   포항공과대학교                  경상북도 포항시 남구 청암로 77
6     고려대학교                   서울특별시 성북구 안암로 145
7     경희대학교                  서울특별시 동대문구 경희대로 26
8     세종대학교                 ^!서울특별시 광진구 능동로 209
9     한양대학교                  서울특별시 성동구 왕십리로 222
10     GIST                  광주광역시 북구 첨단과기로 123
11    아주대학교                경기도 수원시 영통구 월드컵로 206
12    중앙대학교      서울특별시 동작구 흑석로 84
13  이화여자대학교       __________서울특별시 서대문구 이화여대길 52
14    건국대학교                   서울특별시 광진구 능동로 120
15    경북대학교          대구광역시 북구 대학로 80
16    울산대학교                  울산광역시 남구 대학로 93___
17    부산대학교               부산광역시 금정구 부산대학로63번길 2
18    영남대학교                    경상북도 경산시 대학로 280
19   가톨릭대학교               서울특별시 종로구 창경궁로 296-12

In [57]:
# str.strip(to_strip = None)
# 선행 및 후행 문자를 제거
df['주소'].str.strip(to_strip = '_^!#? /%')

0            서울특별시 관악구 관악로 1
1          대전광역시 유성구 대학로 291
2        서울특별시 종로구 성균관로 25-2
3          서울특별시 서대문구 연세로 50
4     울산광역시 울주군 언양읍 유니스트길 50
5         경상북도 포항시 남구 청암로 77
6          서울특별시 성북구 안암로 145
7         서울특별시 동대문구 경희대로 26
8          서울특별시 광진구 능동로 209
9         서울특별시 성동구 왕십리로 222
10        광주광역시 북구 첨단과기로 123
11      경기도 수원시 영통구 월드컵로 206
12          서울특별시 동작구 흑석로 84
13       서울특별시 서대문구 이화여대길 52
14         서울특별시 광진구 능동로 120
15           대구광역시 북구 대학로 80
16           울산광역시 남구 대학로 93
17     부산광역시 금정구 부산대학로63번길 2
18          경상북도 경산시 대학로 280
19     서울특별시 종로구 창경궁로 296-12
Name: 주소, dtype: object

In [58]:
# str.lstrip(to_strip = None)
# 선행 문자를 제거
df['주소'].str.lstrip(to_strip = '_^!#? /%')

0                    서울특별시 관악구 관악로 1
1               대전광역시 유성구 대학로 291 ##
2                서울특별시 종로구 성균관로 25-2
3                  서울특별시 서대문구 연세로 50
4           울산광역시 울주군 언양읍 유니스트길 50 %
5                 경상북도 포항시 남구 청암로 77
6                  서울특별시 성북구 안암로 145
7                 서울특별시 동대문구 경희대로 26
8                  서울특별시 광진구 능동로 209
9                 서울특별시 성동구 왕십리로 222
10                광주광역시 북구 첨단과기로 123
11              경기도 수원시 영통구 월드컵로 206
12    서울특별시 동작구 흑석로 84
13               서울특별시 서대문구 이화여대길 52
14                 서울특별시 광진구 능동로 120
15        대구광역시 북구 대학로 80
16                울산광역시 남구 대학로 93___
17             부산광역시 금정구 부산대학로63번길 2
18                  경상북도 경산시 대학로 280
19             서울특별시 종로구 창경궁로 296-12
Name: 주소, dtype: object

In [59]:
# str.rstrip(to_strip=None)
# 후행 문자를 제거
df['주소'].str.rstrip(to_strip = '_^!#? /%')

0                      /!서울특별시 관악구 관악로 1
1                      대전광역시 유성구 대학로 291
2                    서울특별시 종로구 성균관로 25-2
3                      서울특별시 서대문구 연세로 50
4              ## 울산광역시 울주군 언양읍 유니스트길 50
5                     경상북도 포항시 남구 청암로 77
6                      서울특별시 성북구 안암로 145
7                     서울특별시 동대문구 경희대로 26
8                    ^!서울특별시 광진구 능동로 209
9                     서울특별시 성동구 왕십리로 222
10                    광주광역시 북구 첨단과기로 123
11                  경기도 수원시 영통구 월드컵로 206
12                      서울특별시 동작구 흑석로 84
13         __________서울특별시 서대문구 이화여대길 52
14                     서울특별시 광진구 능동로 120
15                       대구광역시 북구 대학로 80
16                       울산광역시 남구 대학로 93
17                 부산광역시 금정구 부산대학로63번길 2
18                      경상북도 경산시 대학로 280
19                 서울특별시 종로구 창경궁로 296-12
Name: 주소, dtype: object

In [60]:
# 대소문자 변경
# .str.lower() : 모두 소문자로 변경
# .str.upper() : 모두 대문자로 변경
# .str.swapcase() : 소문자는 대문자, 대문자는 소문자로 변경

### 2절. 날짜 데이터 다루기

#### 1. datetime형

In [61]:
import pandas as pd

# 데이터프레임 불러오기
df = pd.read_csv('data/예제/University_date.csv', encoding = 'CP949')

In [62]:
# 날짜 형태인 문자열
df['창립일']

0    1946-10-15
1    1971-02-16
2    2007-09-03
3    1986-12-03
4    1905-05-05
5    1993-11-17
6    1946-05-15
7    1969-12-24
8    1946-05-15
Name: 창립일, dtype: object

In [63]:
# pandas.to_datetime()
# 문자열 -> datetime형
pd.to_datetime(df['창립일']) # 구문 분석 자동

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [64]:
# 문자열 -> datetime형
pd.to_datetime(df['창립일'], format = '%Y-%m-%d') # '네자리연도-월-일'로 구문 분석

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [65]:
# 기존의 창립일 열을 datatime형을 변환
df['창립일'] = pd.to_datetime(df['창립일'])

In [66]:
# 시계열생성
# 2000년 1월 1일부터 2000년 1월 10일까지 1일 단위로 생성
pd.date_range("2000-01-01", "2000-01-10")

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10'],
              dtype='datetime64[ns]', freq='D')

In [67]:
# 2000년 1월 1일부터 1일씩 증가(3번 반복)
pd.date_range("2000-01-01", periods = 3)

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03'], dtype='datetime64[ns]', freq='D')

In [68]:
# 2000년 1월부터 1달씩 증가(5번 반복)
# 각 달의 마지막 날짜가 반환됨(freq = "m")
pd.date_range("2000-01-01", periods = 5, freq = "m")

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31'],
              dtype='datetime64[ns]', freq='M')

##### 2. 시계열 데이터 전처리

In [69]:
# 데이터프레임 불러와 기존의 창립일 열을 datatime형을 변환
df = pd.read_csv('data/예제/University_date.csv', encoding = 'CP949')
df['창립일'] = pd.to_datetime(df['창립일'])

# 메소드 dt의 하위 메소드를 통한 날짜와 시간에 대한 정보를 확인
# dt.date : 날짜정보(연월일)
df['창립일'].dt.date

0    1946-10-15
1    1971-02-16
2    2007-09-03
3    1986-12-03
4    1905-05-05
5    1993-11-17
6    1946-05-15
7    1969-12-24
8    1946-05-15
Name: 창립일, dtype: object

In [70]:
# dt.year : 연도
df['창립일'].dt.year

0    1946
1    1971
2    2007
3    1986
4    1905
5    1993
6    1946
7    1969
8    1946
Name: 창립일, dtype: int64

In [71]:
# dt.month : 월
df['창립일'].dt.month

0    10
1     2
2     9
3    12
4     5
5    11
6     5
7    12
8     5
Name: 창립일, dtype: int64

In [72]:
# dt.month_name() : 월이름
df['창립일'].dt.month_name()

0      October
1     February
2    September
3     December
4          May
5     November
6          May
7     December
8          May
Name: 창립일, dtype: object

In [73]:
# dt.day : 일
df['창립일'].dt.day

0    15
1    16
2     3
3     3
4     5
5    17
6    15
7    24
8    15
Name: 창립일, dtype: int64

In [74]:
# dt.weekday : 요일번호
df['창립일'].dt.weekday

0    1
1    1
2    0
3    2
4    4
5    2
6    2
7    2
8    2
Name: 창립일, dtype: int64

In [75]:
# dt.day_name() : 요일이름
df['창립일'].dt.day_name()

0      Tuesday
1      Tuesday
2       Monday
3    Wednesday
4       Friday
5    Wednesday
6    Wednesday
7    Wednesday
8    Wednesday
Name: 창립일, dtype: object

In [76]:
# dt.quarter : 분기
df['창립일'].dt.quarter

0    4
1    1
2    3
3    4
4    2
5    4
6    2
7    4
8    2
Name: 창립일, dtype: int64

In [77]:
# weekofyear : 연도기준 주
df['창립일'].dt.weekofyear

<ipython-input-77-8770ed159db1>:2: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df['창립일'].dt.weekofyear

0    42
1     7
2    36
3    49
4    18
5    46
6    20
7    52
8    20
Name: 창립일, dtype: int64

In [78]:
# dayofyear : 연도기준 일
df['창립일'].dt.dayofyear

0    288
1     47
2    246
3    337
4    125
5    321
6    135
7    358
8    135
Name: 창립일, dtype: int64

In [79]:
# daysinmonth : 해당 월의 총 일수
df['창립일'].dt.daysinmonth

0    31
1    28
2    30
3    31
4    31
5    30
6    31
7    31
8    31
Name: 창립일, dtype: int64

In [80]:
# 2022-06-01 16:30:05부터 1초씩 증가(10번 반복)하는 시계열 생성
sr  = pd.Series(pd.date_range("2022-06-01 16:30:05", periods  = 5, freq = "s"))
sr

0   2022-06-01 16:30:05
1   2022-06-01 16:30:06
2   2022-06-01 16:30:07
3   2022-06-01 16:30:08
4   2022-06-01 16:30:09
dtype: datetime64[ns]

In [81]:
# dt.time : 시간정보(시분초)
sr.dt.time

0    16:30:05
1    16:30:06
2    16:30:07
3    16:30:08
4    16:30:09
dtype: object

In [82]:
# dt.hour : 시
sr.dt.hour

0    16
1    16
2    16
3    16
4    16
dtype: int64

In [83]:
# dt.minute : 분
sr.dt.minute

0    30
1    30
2    30
3    30
4    30
dtype: int64

In [84]:
# dt.second : 초
sr.dt.second

0    5
1    6
2    7
3    8
4    9
dtype: int64

# (끝)